---
kind: method
id: M:Autodesk.Revit.DB.VertexIndexPairArray.ReverseIterator
source: html/da665fb0-51d9-3089-b739-697a70d2d4fb.htm
---
# Autodesk.Revit.DB.VertexIndexPairArray.ReverseIterator Method

Retrieve a backward moving iterator to the array.

## Syntax (C#)
```csharp
public virtual VertexIndexPairArrayIterator ReverseIterator()
```

## Returns
Returns a backward moving iterator to the array.